package usw.suwiki.domain.lecture;

// todo: 고려하고 적용하기
public enum Major {
  // 인성교약대학
  교양대학, 교양, 교양_야,

  // 인문사회융합대학
  인문학부, 국어국문학, 사학,
  외국어학부, 영어영문학, 프랑스어문학, 러시아어문학, 일어일문학, 중어중문학,
  법_행정학부, 법학, 행정학,
  미디어커뮤니케이션학과, 행정학과_야, 소방행정학과_야,

  // 경영공학대학
  경영학부, 경영, 글로벌비즈니스, 회계,
  경제학부, 경제금융, 국제개발협력,
  호텔관광학부, 호텔경영, 외식경영, 관광경영,
  창업학_융복합전공,

  // 혁신공과대학
  바이오화학산업학부, 바이오공학_및_마케팅, 융합화학산업,
  건설환경에너지공학부, 건설환경공학, 환경에너지공학,
  건축도시부동산학부, 건축학, 도시부동산학,
  산업및기계공학부, 산업_및_기계공학부, 산업공학, 기계공학,
  반도체공학과,
  전기전자공학부, 전기공학, 전자공학,
  화학공학_신소재공학부, 화공신소재공학부, 신소재공학, 화학공학,

  // 지능형SW융합대학
  컴퓨터학부, 컴퓨터SW, 미디어SW,
  정보통신학부, 정보통신, 정보보호,
  데이터과학부,
  클라우드융복합전공,

  // 라이프케어사이언스대학
  간호학과, 아동가족복지학과, 의류학과, 식품영양학과,
  스포츠과학부, 체육학, 레저스포츠, 운동건강관리,

  // 디자인앤아트대학
  조형예술학부, 회화, 조소,
  디자인학부, 커뮤니케이션디자인, 패션디자인, 공예디자인,

  // 음악테크놀로지대학
  아트앤테크놀로지작곡과, 성악과, 피아노과, 관현악과, 국악과, 작곡과,

  // 문화예술융합대학
  아트앤엔터테인먼트학부, 영화예술, 연기예술, 디지털콘텐츠, 영화영상,

  // E.T.C
  전자재료공학부, 연극, 무용, 문화콘텐츠테크놀러지, 자유전공학부, 문화예술학부, 전자재료공학, 전자물리, 바이오싸이언스, 시스템반도체융복합전공,
}
